
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hiyoko3m/memo-board/actions/runs/3121820432)



<pre><code>Apply complete! Resources: 4 added, 6 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/4709fd93-a991-4f8a-b727-c3fe03b2d866/terraform-bin apply -auto-approve -input=false
data.http.ghactions_oidc_config: Reading...
data.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]
data.tls_certificate.ghactions: Reading...
data.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]
data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.memo_board_tf1: Reading...
data.aws_iam_policy_document.memo_board_tf_exec: Reading...
aws_vpc.memo_board: Refreshing state... [id=vpc-07dac755b05cdc5e5]
aws_ecr_repository.memo-board-rs: Refreshing state... [id=memo-board-rs]
aws_iam_user.memo_board: Refreshing state... [id=memo-board]
aws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]
data.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=3895582566]
aws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]
data.aws_iam_policy_document.memo_board_tf_exec: Read complete after 0s [id=356400302]
aws_iam_policy.memo_board_tf_exec: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf_exec]
data.aws_iam_policy_document.memo_board_cd: Reading...
data.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]
data.aws_iam_policy_document.memo_board_tf: Reading...
aws_iam_role.memo_board_cd: Refreshing state... [id=memo-board-cd]
data.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]
aws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]
data.aws_caller_identity.current: Read complete after 0s [id=281036478087]
aws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]
aws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]
aws_iam_role_policy_attachment.memo_board_tf_exec: Refreshing state... [id=memo-board-tf-20220925063856285400000001]
data.aws_iam_policy_document.memo_board_cd1: Reading...
data.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=2009583181]
aws_iam_policy.memo_board_cd1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]
aws_iam_role_policy_attachment.memo_board_cd1: Refreshing state... [id=memo-board-cd-20220925012718679900000001]
aws_internet_gateway.memo_board: Refreshing state... [id=igw-0310af73c3aeaf62f]
aws_subnet.memo_board_3: Refreshing state... [id=subnet-0f84ebfae4c920a30]
aws_subnet.memo_board_1: Refreshing state... [id=subnet-047a19359c4468354]
aws_subnet.memo_board_2: Refreshing state... [id=subnet-0ae15c749b9813fb9]
aws_route_table.public: Refreshing state... [id=rtb-065eee68b235bf30b]
aws_route_table_association.memo_board_1: Refreshing state... [id=rtbassoc-0c58c63df918ad4fc]
aws_route_table_association.memo_board_2: Refreshing state... [id=rtbassoc-03236e787ed43a072]
aws_route_table_association.memo_board_3: Refreshing state... [id=rtbassoc-013da13c782db7bbf]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_internet_gateway.memo_board will be updated in-place
  ~ resource "aws_internet_gateway" "memo_board" {
        id       = "igw-0310af73c3aeaf62f"
      ~ tags     = {
          + "Name" = "memo_board"
        }
      ~ tags_all = {
          + "Name" = "memo_board"
        }
        # (3 unchanged attributes hidden)
    }

  # aws_lb.memo_board will be created
  + resource "aws_lb" "memo_board" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 30
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "memo-board"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-047a19359c4468354",
          + "subnet-0ae15c749b9813fb9",
          + "subnet-0f84ebfae4c920a30",
        ]
      + tags_all                   = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # aws_lb_listener.memo_board_rs will be created
  + resource "aws_lb_listener" "memo_board_rs" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:ap-northeast-1:281036478087:certificate/305d7a9c-79cb-4f67-9738-211c0932f202"
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 8443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.memo_board_rs will be created
  + resource "aws_lb_target_group" "memo_board_rs" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "10"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "memo-board-rs"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "instance"
      + vpc_id                             = "vpc-07dac755b05cdc5e5"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 2
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # aws_route_table.public will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-065eee68b235bf30b"
      ~ tags             = {
          + "Name" = "memo_board"
        }
      ~ tags_all         = {
          + "Name" = "memo_board"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_security_group.memo_board_lb will be created
  + resource "aws_security_group" "memo_board_lb" {
      + arn                    = (known after apply)
      + description            = "For load balancer"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8443
              + ipv6_cidr_blocks = [
                  + "::/0",
                ]
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8443
            },
        ]
      + name                   = "memo_board_lb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-07dac755b05cdc5e5"
    }

  # aws_subnet.memo_board_1 will be updated in-place
  ~ resource "aws_subnet" "memo_board_1" {
        id                                             = "subnet-047a19359c4468354"
      ~ tags                                           = {
          + "Name" = "memo_board_1"
        }
      ~ tags_all                                       = {
          + "Name" = "memo_board_1"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_subnet.memo_board_2 will be updated in-place
  ~ resource "aws_subnet" "memo_board_2" {
        id                                             = "subnet-0ae15c749b9813fb9"
      ~ tags                                           = {
          + "Name" = "memo_board_2"
        }
      ~ tags_all                                       = {
          + "Name" = "memo_board_2"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_subnet.memo_board_3 will be updated in-place
  ~ resource "aws_subnet" "memo_board_3" {
        id                                             = "subnet-0f84ebfae4c920a30"
      ~ tags                                           = {
          + "Name" = "memo_board_3"
        }
      ~ tags_all                                       = {
          + "Name" = "memo_board_3"
        }
        # (14 unchanged attributes hidden)
    }

  # aws_vpc.memo_board will be updated in-place
  ~ resource "aws_vpc" "memo_board" {
        id                               = "vpc-07dac755b05cdc5e5"
      ~ tags                             = {
          + "Name" = "memo_board"
        }
      ~ tags_all                         = {
          + "Name" = "memo_board"
        }
        # (15 unchanged attributes hidden)
    }

Plan: 4 to add, 6 to change, 0 to destroy.
aws_vpc.memo_board: Modifying... [id=vpc-07dac755b05cdc5e5]
aws_vpc.memo_board: Modifications complete after 1s [id=vpc-07dac755b05cdc5e5]
aws_security_group.memo_board_lb: Creating...
aws_lb_target_group.memo_board_rs: Creating...
aws_internet_gateway.memo_board: Modifying... [id=igw-0310af73c3aeaf62f]
aws_subnet.memo_board_2: Modifying... [id=subnet-0ae15c749b9813fb9]
aws_subnet.memo_board_3: Modifying... [id=subnet-0f84ebfae4c920a30]
aws_subnet.memo_board_1: Modifying... [id=subnet-047a19359c4468354]
aws_subnet.memo_board_2: Modifications complete after 1s [id=subnet-0ae15c749b9813fb9]
aws_internet_gateway.memo_board: Modifications complete after 1s [id=igw-0310af73c3aeaf62f]
aws_route_table.public: Modifying... [id=rtb-065eee68b235bf30b]
aws_subnet.memo_board_1: Modifications complete after 1s [id=subnet-047a19359c4468354]
aws_subnet.memo_board_3: Modifications complete after 2s [id=subnet-0f84ebfae4c920a30]
aws_route_table.public: Modifications complete after 1s [id=rtb-065eee68b235bf30b]
aws_lb_target_group.memo_board_rs: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/63ac7b39098cfb95]
aws_security_group.memo_board_lb: Creation complete after 4s [id=sg-00431c32160f37d85]
aws_lb.memo_board: Creating...
aws_lb.memo_board: Still creating... [10s elapsed]
aws_lb.memo_board: Still creating... [20s elapsed]
aws_lb.memo_board: Still creating... [30s elapsed]
aws_lb.memo_board: Still creating... [40s elapsed]
aws_lb.memo_board: Still creating... [50s elapsed]
aws_lb.memo_board: Still creating... [1m0s elapsed]
aws_lb.memo_board: Still creating... [1m10s elapsed]
aws_lb.memo_board: Still creating... [1m20s elapsed]
aws_lb.memo_board: Still creating... [1m30s elapsed]
aws_lb.memo_board: Still creating... [1m40s elapsed]
aws_lb.memo_board: Still creating... [1m50s elapsed]
aws_lb.memo_board: Still creating... [2m0s elapsed]
aws_lb.memo_board: Creation complete after 2m4s [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:loadbalancer/app/memo-board/269c7f5bae10427e]
aws_lb_listener.memo_board_rs: Creating...
aws_lb_listener.memo_board_rs: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:listener/app/memo-board/269c7f5bae10427e/26e500ed2f05c21e]

Apply complete! Resources: 4 added, 6 changed, 0 destroyed.
::debug::Terraform exited with code 0.
::debug::stdout: data.http.ghactions_oidc_config: Reading...%0Adata.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]%0Adata.tls_certificate.ghactions: Reading...%0Adata.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]%0Adata.aws_caller_identity.current: Reading...%0Adata.aws_iam_policy_document.memo_board_tf1: Reading...%0Adata.aws_iam_policy_document.memo_board_tf_exec: Reading...%0Aaws_vpc.memo_board: Refreshing state... [id=vpc-07dac755b05cdc5e5]%0Aaws_ecr_repository.memo-board-rs: Refreshing state... [id=memo-board-rs]%0Aaws_iam_user.memo_board: Refreshing state... [id=memo-board]%0Aaws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=3895582566]%0Aaws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]%0Adata.aws_iam_policy_document.memo_board_tf_exec: Read complete after 0s [id=356400302]%0Aaws_iam_policy.memo_board_tf_exec: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf_exec]%0Adata.aws_iam_policy_document.memo_board_cd: Reading...%0Adata.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]%0Adata.aws_iam_policy_document.memo_board_tf: Reading...%0Aaws_iam_role.memo_board_cd: Refreshing state... [id=memo-board-cd]%0Adata.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]%0Aaws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]%0Adata.aws_caller_identity.current: Read complete after 0s [id=281036478087]%0Aaws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]%0Aaws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]%0Aaws_iam_role_policy_attachment.memo_board_tf_exec: Refreshing state... [id=memo-board-tf-20220925063856285400000001]%0Adata.aws_iam_policy_document.memo_board_cd1: Reading...%0Adata.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=2009583181]%0Aaws_iam_policy.memo_board_cd1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_iam_role_policy_attachment.memo_board_cd1: Refreshing state... [id=memo-board-cd-20220925012718679900000001]%0Aaws_internet_gateway.memo_board: Refreshing state... [id=igw-0310af73c3aeaf62f]%0Aaws_subnet.memo_board_3: Refreshing state... [id=subnet-0f84ebfae4c920a30]%0Aaws_subnet.memo_board_1: Refreshing state... [id=subnet-047a19359c4468354]%0Aaws_subnet.memo_board_2: Refreshing state... [id=subnet-0ae15c749b9813fb9]%0Aaws_route_table.public: Refreshing state... [id=rtb-065eee68b235bf30b]%0Aaws_route_table_association.memo_board_1: Refreshing state... [id=rtbassoc-0c58c63df918ad4fc]%0Aaws_route_table_association.memo_board_2: Refreshing state... [id=rtbassoc-03236e787ed43a072]%0Aaws_route_table_association.memo_board_3: Refreshing state... [id=rtbassoc-013da13c782db7bbf]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # aws_internet_gateway.memo_board will be updated in-place%0A  ~ resource "aws_internet_gateway" "memo_board" {%0A        id       = "igw-0310af73c3aeaf62f"%0A      ~ tags     = {%0A          + "Name" = "memo_board"%0A        }%0A      ~ tags_all = {%0A          + "Name" = "memo_board"%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # aws_lb.memo_board will be created%0A  + resource "aws_lb" "memo_board" {%0A      + arn                        = (known after apply)%0A      + arn_suffix                 = (known after apply)%0A      + desync_mitigation_mode     = "defensive"%0A      + dns_name                   = (known after apply)%0A      + drop_invalid_header_fields = false%0A      + enable_deletion_protection = false%0A      + enable_http2               = true%0A      + enable_waf_fail_open       = false%0A      + id                         = (known after apply)%0A      + idle_timeout               = 30%0A      + internal                   = (known after apply)%0A      + ip_address_type            = (known after apply)%0A      + load_balancer_type         = "application"%0A      + name                       = "memo-board"%0A      + preserve_host_header       = false%0A      + security_groups            = (known after apply)%0A      + subnets                    = [%0A          + "subnet-047a19359c4468354",%0A          + "subnet-0ae15c749b9813fb9",%0A          + "subnet-0f84ebfae4c920a30",%0A        ]%0A      + tags_all                   = (known after apply)%0A      + vpc_id                     = (known after apply)%0A      + zone_id                    = (known after apply)%0A%0A      + subnet_mapping {%0A          + allocation_id        = (known after apply)%0A          + ipv6_address         = (known after apply)%0A          + outpost_id           = (known after apply)%0A          + private_ipv4_address = (known after apply)%0A          + subnet_id            = (known after apply)%0A        }%0A    }%0A%0A  # aws_lb_listener.memo_board_rs will be created%0A  + resource "aws_lb_listener" "memo_board_rs" {%0A      + arn               = (known after apply)%0A      + certificate_arn   = "arn:aws:acm:ap-northeast-1:281036478087:certificate/305d7a9c-79cb-4f67-9738-211c0932f202"%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 8443%0A      + protocol          = "HTTPS"%0A      + ssl_policy        = "ELBSecurityPolicy-2016-08"%0A      + tags_all          = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A    }%0A%0A  # aws_lb_target_group.memo_board_rs will be created%0A  + resource "aws_lb_target_group" "memo_board_rs" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = false%0A      + deregistration_delay               = "10"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + name                               = "memo-board-rs"%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags_all                           = (known after apply)%0A      + target_type                        = "instance"%0A      + vpc_id                             = "vpc-07dac755b05cdc5e5"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 60%0A          + matcher             = "200"%0A          + path                = "/"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 10%0A          + unhealthy_threshold = 2%0A        }%0A%0A      + stickiness {%0A          + cookie_duration = (known after apply)%0A          + cookie_name     = (known after apply)%0A          + enabled         = (known after apply)%0A          + type            = (known after apply)%0A        }%0A    }%0A%0A  # aws_route_table.public will be updated in-place%0A  ~ resource "aws_route_table" "public" {%0A        id               = "rtb-065eee68b235bf30b"%0A      ~ tags             = {%0A          + "Name" = "memo_board"%0A        }%0A      ~ tags_all         = {%0A          + "Name" = "memo_board"%0A        }%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # aws_security_group.memo_board_lb will be created%0A  + resource "aws_security_group" "memo_board_lb" {%0A      + arn                    = (known after apply)%0A      + description            = "For load balancer"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 8443%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 8443%0A            },%0A        ]%0A      + name                   = "memo_board_lb"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = (known after apply)%0A      + vpc_id                 = "vpc-07dac755b05cdc5e5"%0A    }%0A%0A  # aws_subnet.memo_board_1 will be updated in-place%0A  ~ resource "aws_subnet" "memo_board_1" {%0A        id                                             = "subnet-047a19359c4468354"%0A      ~ tags                                           = {%0A          + "Name" = "memo_board_1"%0A        }%0A      ~ tags_all                                       = {%0A          + "Name" = "memo_board_1"%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # aws_subnet.memo_board_2 will be updated in-place%0A  ~ resource "aws_subnet" "memo_board_2" {%0A        id                                             = "subnet-0ae15c749b9813fb9"%0A      ~ tags                                           = {%0A          + "Name" = "memo_board_2"%0A        }%0A      ~ tags_all                                       = {%0A          + "Name" = "memo_board_2"%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # aws_subnet.memo_board_3 will be updated in-place%0A  ~ resource "aws_subnet" "memo_board_3" {%0A        id                                             = "subnet-0f84ebfae4c920a30"%0A      ~ tags                                           = {%0A          + "Name" = "memo_board_3"%0A        }%0A      ~ tags_all                                       = {%0A          + "Name" = "memo_board_3"%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # aws_vpc.memo_board will be updated in-place%0A  ~ resource "aws_vpc" "memo_board" {%0A        id                               = "vpc-07dac755b05cdc5e5"%0A      ~ tags                             = {%0A          + "Name" = "memo_board"%0A        }%0A      ~ tags_all                         = {%0A          + "Name" = "memo_board"%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0APlan: 4 to add, 6 to change, 0 to destroy.%0Aaws_vpc.memo_board: Modifying... [id=vpc-07dac755b05cdc5e5]%0Aaws_vpc.memo_board: Modifications complete after 1s [id=vpc-07dac755b05cdc5e5]%0Aaws_security_group.memo_board_lb: Creating...%0Aaws_lb_target_group.memo_board_rs: Creating...%0Aaws_internet_gateway.memo_board: Modifying... [id=igw-0310af73c3aeaf62f]%0Aaws_subnet.memo_board_2: Modifying... [id=subnet-0ae15c749b9813fb9]%0Aaws_subnet.memo_board_3: Modifying... [id=subnet-0f84ebfae4c920a30]%0Aaws_subnet.memo_board_1: Modifying... [id=subnet-047a19359c4468354]%0Aaws_subnet.memo_board_2: Modifications complete after 1s [id=subnet-0ae15c749b9813fb9]%0Aaws_internet_gateway.memo_board: Modifications complete after 1s [id=igw-0310af73c3aeaf62f]%0Aaws_route_table.public: Modifying... [id=rtb-065eee68b235bf30b]%0Aaws_subnet.memo_board_1: Modifications complete after 1s [id=subnet-047a19359c4468354]%0Aaws_subnet.memo_board_3: Modifications complete after 2s [id=subnet-0f84ebfae4c920a30]%0Aaws_route_table.public: Modifications complete after 1s [id=rtb-065eee68b235bf30b]%0Aaws_lb_target_group.memo_board_rs: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/63ac7b39098cfb95]%0Aaws_security_group.memo_board_lb: Creation complete after 4s [id=sg-00431c32160f37d85]%0Aaws_lb.memo_board: Creating...%0Aaws_lb.memo_board: Still creating... [10s elapsed]%0Aaws_lb.memo_board: Still creating... [20s elapsed]%0Aaws_lb.memo_board: Still creating... [30s elapsed]%0Aaws_lb.memo_board: Still creating... [40s elapsed]%0Aaws_lb.memo_board: Still creating... [50s elapsed]%0Aaws_lb.memo_board: Still creating... [1m0s elapsed]%0Aaws_lb.memo_board: Still creating... [1m10s elapsed]%0Aaws_lb.memo_board: Still creating... [1m20s elapsed]%0Aaws_lb.memo_board: Still creating... [1m30s elapsed]%0Aaws_lb.memo_board: Still creating... [1m40s elapsed]%0Aaws_lb.memo_board: Still creating... [1m50s elapsed]%0Aaws_lb.memo_board: Still creating... [2m0s elapsed]%0Aaws_lb.memo_board: Creation complete after 2m4s [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:loadbalancer/app/memo-board/269c7f5bae10427e]%0Aaws_lb_listener.memo_board_rs: Creating...%0Aaws_lb_listener.memo_board_rs: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:listener/app/memo-board/269c7f5bae10427e/26e500ed2f05c21e]%0A%0AApply complete! Resources: 4 added, 6 changed, 0 destroyed.%0A
::debug::stderr: 
::debug::exitcode: 0

::set-output name=stdout::data.http.ghactions_oidc_config: Reading...%0Adata.http.ghactions_oidc_config: Read complete after 0s [id=https://token.actions.githubusercontent.com/.well-known/openid-configuration]%0Adata.tls_certificate.ghactions: Reading...%0Adata.tls_certificate.ghactions: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]%0Adata.aws_caller_identity.current: Reading...%0Adata.aws_iam_policy_document.memo_board_tf1: Reading...%0Adata.aws_iam_policy_document.memo_board_tf_exec: Reading...%0Aaws_vpc.memo_board: Refreshing state... [id=vpc-07dac755b05cdc5e5]%0Aaws_ecr_repository.memo-board-rs: Refreshing state... [id=memo-board-rs]%0Aaws_iam_user.memo_board: Refreshing state... [id=memo-board]%0Aaws_iam_openid_connect_provider.ghactions: Refreshing state... [id=arn:aws:iam::281036478087:oidc-provider/token.actions.githubusercontent.com]%0Adata.aws_iam_policy_document.memo_board_tf1: Read complete after 0s [id=3895582566]%0Aaws_iam_policy.memo_board_tf1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf1]%0Adata.aws_iam_policy_document.memo_board_tf_exec: Read complete after 0s [id=356400302]%0Aaws_iam_policy.memo_board_tf_exec: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_tf_exec]%0Adata.aws_iam_policy_document.memo_board_cd: Reading...%0Adata.aws_iam_policy_document.memo_board_cd: Read complete after 0s [id=3061374013]%0Adata.aws_iam_policy_document.memo_board_tf: Reading...%0Aaws_iam_role.memo_board_cd: Refreshing state... [id=memo-board-cd]%0Adata.aws_iam_policy_document.memo_board_tf: Read complete after 0s [id=1304283972]%0Aaws_iam_role.memo_board_tf: Refreshing state... [id=memo-board-tf]%0Adata.aws_caller_identity.current: Read complete after 0s [id=281036478087]%0Aaws_iam_role_policy_attachment.memo_board_tf1: Refreshing state... [id=memo-board-tf-20220924090927045200000002]%0Aaws_iam_role_policy_attachment.memo_board_iam: Refreshing state... [id=memo-board-tf-20220924090926312300000001]%0Aaws_iam_role_policy_attachment.memo_board_tf_exec: Refreshing state... [id=memo-board-tf-20220925063856285400000001]%0Adata.aws_iam_policy_document.memo_board_cd1: Reading...%0Adata.aws_iam_policy_document.memo_board_cd1: Read complete after 0s [id=2009583181]%0Aaws_iam_policy.memo_board_cd1: Refreshing state... [id=arn:aws:iam::281036478087:policy/memo_board_cd1]%0Aaws_iam_role_policy_attachment.memo_board_cd1: Refreshing state... [id=memo-board-cd-20220925012718679900000001]%0Aaws_internet_gateway.memo_board: Refreshing state... [id=igw-0310af73c3aeaf62f]%0Aaws_subnet.memo_board_3: Refreshing state... [id=subnet-0f84ebfae4c920a30]%0Aaws_subnet.memo_board_1: Refreshing state... [id=subnet-047a19359c4468354]%0Aaws_subnet.memo_board_2: Refreshing state... [id=subnet-0ae15c749b9813fb9]%0Aaws_route_table.public: Refreshing state... [id=rtb-065eee68b235bf30b]%0Aaws_route_table_association.memo_board_1: Refreshing state... [id=rtbassoc-0c58c63df918ad4fc]%0Aaws_route_table_association.memo_board_2: Refreshing state... [id=rtbassoc-03236e787ed43a072]%0Aaws_route_table_association.memo_board_3: Refreshing state... [id=rtbassoc-013da13c782db7bbf]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # aws_internet_gateway.memo_board will be updated in-place%0A  ~ resource "aws_internet_gateway" "memo_board" {%0A        id       = "igw-0310af73c3aeaf62f"%0A      ~ tags     = {%0A          + "Name" = "memo_board"%0A        }%0A      ~ tags_all = {%0A          + "Name" = "memo_board"%0A        }%0A        # (3 unchanged attributes hidden)%0A    }%0A%0A  # aws_lb.memo_board will be created%0A  + resource "aws_lb" "memo_board" {%0A      + arn                        = (known after apply)%0A      + arn_suffix                 = (known after apply)%0A      + desync_mitigation_mode     = "defensive"%0A      + dns_name                   = (known after apply)%0A      + drop_invalid_header_fields = false%0A      + enable_deletion_protection = false%0A      + enable_http2               = true%0A      + enable_waf_fail_open       = false%0A      + id                         = (known after apply)%0A      + idle_timeout               = 30%0A      + internal                   = (known after apply)%0A      + ip_address_type            = (known after apply)%0A      + load_balancer_type         = "application"%0A      + name                       = "memo-board"%0A      + preserve_host_header       = false%0A      + security_groups            = (known after apply)%0A      + subnets                    = [%0A          + "subnet-047a19359c4468354",%0A          + "subnet-0ae15c749b9813fb9",%0A          + "subnet-0f84ebfae4c920a30",%0A        ]%0A      + tags_all                   = (known after apply)%0A      + vpc_id                     = (known after apply)%0A      + zone_id                    = (known after apply)%0A%0A      + subnet_mapping {%0A          + allocation_id        = (known after apply)%0A          + ipv6_address         = (known after apply)%0A          + outpost_id           = (known after apply)%0A          + private_ipv4_address = (known after apply)%0A          + subnet_id            = (known after apply)%0A        }%0A    }%0A%0A  # aws_lb_listener.memo_board_rs will be created%0A  + resource "aws_lb_listener" "memo_board_rs" {%0A      + arn               = (known after apply)%0A      + certificate_arn   = "arn:aws:acm:ap-northeast-1:281036478087:certificate/305d7a9c-79cb-4f67-9738-211c0932f202"%0A      + id                = (known after apply)%0A      + load_balancer_arn = (known after apply)%0A      + port              = 8443%0A      + protocol          = "HTTPS"%0A      + ssl_policy        = "ELBSecurityPolicy-2016-08"%0A      + tags_all          = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = (known after apply)%0A          + type             = "forward"%0A        }%0A    }%0A%0A  # aws_lb_target_group.memo_board_rs will be created%0A  + resource "aws_lb_target_group" "memo_board_rs" {%0A      + arn                                = (known after apply)%0A      + arn_suffix                         = (known after apply)%0A      + connection_termination             = false%0A      + deregistration_delay               = "10"%0A      + id                                 = (known after apply)%0A      + ip_address_type                    = (known after apply)%0A      + lambda_multi_value_headers_enabled = false%0A      + load_balancing_algorithm_type      = (known after apply)%0A      + name                               = "memo-board-rs"%0A      + port                               = 80%0A      + preserve_client_ip                 = (known after apply)%0A      + protocol                           = "HTTP"%0A      + protocol_version                   = (known after apply)%0A      + proxy_protocol_v2                  = false%0A      + slow_start                         = 0%0A      + tags_all                           = (known after apply)%0A      + target_type                        = "instance"%0A      + vpc_id                             = "vpc-07dac755b05cdc5e5"%0A%0A      + health_check {%0A          + enabled             = true%0A          + healthy_threshold   = 2%0A          + interval            = 60%0A          + matcher             = "200"%0A          + path                = "/"%0A          + port                = "traffic-port"%0A          + protocol            = "HTTP"%0A          + timeout             = 10%0A          + unhealthy_threshold = 2%0A        }%0A%0A      + stickiness {%0A          + cookie_duration = (known after apply)%0A          + cookie_name     = (known after apply)%0A          + enabled         = (known after apply)%0A          + type            = (known after apply)%0A        }%0A    }%0A%0A  # aws_route_table.public will be updated in-place%0A  ~ resource "aws_route_table" "public" {%0A        id               = "rtb-065eee68b235bf30b"%0A      ~ tags             = {%0A          + "Name" = "memo_board"%0A        }%0A      ~ tags_all         = {%0A          + "Name" = "memo_board"%0A        }%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # aws_security_group.memo_board_lb will be created%0A  + resource "aws_security_group" "memo_board_lb" {%0A      + arn                    = (known after apply)%0A      + description            = "For load balancer"%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = ""%0A              + from_port        = 8443%0A              + ipv6_cidr_blocks = [%0A                  + "::/0",%0A                ]%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 8443%0A            },%0A        ]%0A      + name                   = "memo_board_lb"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags_all               = (known after apply)%0A      + vpc_id                 = "vpc-07dac755b05cdc5e5"%0A    }%0A%0A  # aws_subnet.memo_board_1 will be updated in-place%0A  ~ resource "aws_subnet" "memo_board_1" {%0A        id                                             = "subnet-047a19359c4468354"%0A      ~ tags                                           = {%0A          + "Name" = "memo_board_1"%0A        }%0A      ~ tags_all                                       = {%0A          + "Name" = "memo_board_1"%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # aws_subnet.memo_board_2 will be updated in-place%0A  ~ resource "aws_subnet" "memo_board_2" {%0A        id                                             = "subnet-0ae15c749b9813fb9"%0A      ~ tags                                           = {%0A          + "Name" = "memo_board_2"%0A        }%0A      ~ tags_all                                       = {%0A          + "Name" = "memo_board_2"%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # aws_subnet.memo_board_3 will be updated in-place%0A  ~ resource "aws_subnet" "memo_board_3" {%0A        id                                             = "subnet-0f84ebfae4c920a30"%0A      ~ tags                                           = {%0A          + "Name" = "memo_board_3"%0A        }%0A      ~ tags_all                                       = {%0A          + "Name" = "memo_board_3"%0A        }%0A        # (14 unchanged attributes hidden)%0A    }%0A%0A  # aws_vpc.memo_board will be updated in-place%0A  ~ resource "aws_vpc" "memo_board" {%0A        id                               = "vpc-07dac755b05cdc5e5"%0A      ~ tags                             = {%0A          + "Name" = "memo_board"%0A        }%0A      ~ tags_all                         = {%0A          + "Name" = "memo_board"%0A        }%0A        # (15 unchanged attributes hidden)%0A    }%0A%0APlan: 4 to add, 6 to change, 0 to destroy.%0Aaws_vpc.memo_board: Modifying... [id=vpc-07dac755b05cdc5e5]%0Aaws_vpc.memo_board: Modifications complete after 1s [id=vpc-07dac755b05cdc5e5]%0Aaws_security_group.memo_board_lb: Creating...%0Aaws_lb_target_group.memo_board_rs: Creating...%0Aaws_internet_gateway.memo_board: Modifying... [id=igw-0310af73c3aeaf62f]%0Aaws_subnet.memo_board_2: Modifying... [id=subnet-0ae15c749b9813fb9]%0Aaws_subnet.memo_board_3: Modifying... [id=subnet-0f84ebfae4c920a30]%0Aaws_subnet.memo_board_1: Modifying... [id=subnet-047a19359c4468354]%0Aaws_subnet.memo_board_2: Modifications complete after 1s [id=subnet-0ae15c749b9813fb9]%0Aaws_internet_gateway.memo_board: Modifications complete after 1s [id=igw-0310af73c3aeaf62f]%0Aaws_route_table.public: Modifying... [id=rtb-065eee68b235bf30b]%0Aaws_subnet.memo_board_1: Modifications complete after 1s [id=subnet-047a19359c4468354]%0Aaws_subnet.memo_board_3: Modifications complete after 2s [id=subnet-0f84ebfae4c920a30]%0Aaws_route_table.public: Modifications complete after 1s [id=rtb-065eee68b235bf30b]%0Aaws_lb_target_group.memo_board_rs: Creation complete after 2s [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:targetgroup/memo-board-rs/63ac7b39098cfb95]%0Aaws_security_group.memo_board_lb: Creation complete after 4s [id=sg-00431c32160f37d85]%0Aaws_lb.memo_board: Creating...%0Aaws_lb.memo_board: Still creating... [10s elapsed]%0Aaws_lb.memo_board: Still creating... [20s elapsed]%0Aaws_lb.memo_board: Still creating... [30s elapsed]%0Aaws_lb.memo_board: Still creating... [40s elapsed]%0Aaws_lb.memo_board: Still creating... [50s elapsed]%0Aaws_lb.memo_board: Still creating... [1m0s elapsed]%0Aaws_lb.memo_board: Still creating... [1m10s elapsed]%0Aaws_lb.memo_board: Still creating... [1m20s elapsed]%0Aaws_lb.memo_board: Still creating... [1m30s elapsed]%0Aaws_lb.memo_board: Still creating... [1m40s elapsed]%0Aaws_lb.memo_board: Still creating... [1m50s elapsed]%0Aaws_lb.memo_board: Still creating... [2m0s elapsed]%0Aaws_lb.memo_board: Creation complete after 2m4s [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:loadbalancer/app/memo-board/269c7f5bae10427e]%0Aaws_lb_listener.memo_board_rs: Creating...%0Aaws_lb_listener.memo_board_rs: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:281036478087:listener/app/memo-board/269c7f5bae10427e/26e500ed2f05c21e]%0A%0AApply complete! Resources: 4 added, 6 changed, 0 destroyed.%0A

::set-output name=stderr::

::set-output name=exitcode::0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":20,"Program":"tfcmt","SHA1":"701ab2464726433a0798f60cd92a88d282adfbcf","Vars":{},"WorkflowName":"Terraform"} -->